app/controllers/resumes_controller.rb

SELECT "resumes".* FROM "resumes"
---
  def index
    @resumes = Resume.all

INSERT INTO "resumes" ("cedula", "nombre", "apellido", "direccion", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @resume = Resume.new(resume_params)

    respond_to do |format|
      if @resume.save

UPDATE "resumes" SET "avatar" = $1, "updated_at" = $2 WHERE "resumes"."id" = $3  [["avatar", "camisa.jpg"], ["updated_at", "2017-03-22 21:22:56.433128"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @resume.update(resume_params)

SELECT  "resumes".* FROM "resumes" WHERE "resumes"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_resume
      @resume = Resume.find(params[:id])